app/controllers/scripts_controller.rb

SELECT * FROM `scripts`
---
  def index
    @scripts = Script.paginate :page => params["page"], :order => "created_at DESC"

INSERT INTO `scripts` (`name`, `updated_at`, `code`, `user_id`, `created_at`) VALUES('Test Cube', '2010-08-21 22:42:34', '\r\n\r\n// Size of cube on X axis\r\nwidth = 10;\r\n\r\n// Size of cube on Y axis\r\nlength = 10;\r\n\r\n// How tall the cube is on Z axis\r\nheight = 10;\r\n\r\n// Diameter of the hole in the center\r\nhole_diameter = 4; // 3, 4, 8\r\n\r\n// Which way should the hole go?\r\nhole_orientation = \"vertical\"; // vertical, horizontal\r\n\r\nmodule test_cube() {\r\n	difference() {\r\n		cube([width, length, height], center = true);\r\n\r\n		if (hole_orientation == \"horizontal\") {\r\n			rotate([0,90,0]) {\r\n				cylinder(width+2, hole_diameter/2, hole_diameter/2, center = true);\r\n			}\r\n		} else {\r\n			cylinder(height+2, hole_diameter/2, hole_diameter/2, center = true);\r\n		}\r\n	}\r\n}\r\n\r\ntranslate([0, 0, height/2]) {\r\n	test_cube();\r\n}\r\n', 1, '2010-08-21 22:42:34')
---
  def create
    @script = current_user.scripts.build(params[:script])

    respond_to do |format|
      if @script.save

UPDATE `scripts` SET `code` = '\r\n\r\n// Size of cube on X axis\r\nwidth = 10;\r\n\r\n// Size of cube on Y axis\r\nlength = 10;\r\n\r\n// How tall the cube is on Z axis\r\nheight = 10;\r\n\r\n// Diameter of the hole in the center\r\nhole_diameter = 4; // 3, 4, 8\r\n\r\n// Which way should the hole go?\r\nhole_orientation = \"vertical\"; // vertical, horizontal\r\n\r\nmodule test_cube() {\r\n\r\n	// test\r\n	foo = \"bar\";\r\n\r\n	difference() {\r\n		cube([width, length, height], center = true);\r\n\r\n		if (hole_orientation == \"horizontal\") {\r\n			rotate([0,90,0]) {\r\n				cylinder(width+2, hole_diameter/2, hole_diameter/2, center = true);\r\n			}\r\n		} else {\r\n			cylinder(height+2, hole_diameter/2, hole_diameter/2, center = true);\r\n		}\r\n	}\r\n}\r\n\r\ntranslate([0, 0, height/2]) {\r\n	test_cube();\r\n}\r\n', `updated_at` = '2010-08-22 02:49:05' WHERE `id` = 1
---
  def update
    respond_to do |format|
      if @script.update_attributes(params[:script])

DELETE FROM `scripts` WHERE `id` = 2
---
  def destroy
    @script.destroy