app/controllers/users_controller.rb

  def create
    # Everyone will now know the invite code OH NOES!  Please be gentle on the poor test server...
    if ['teaearlgreyhot'].include?(params[:invitation_code])
      ok = true
    else
      ok = false
    end

    @user = User.new(params[:user])

    if ok and @user.save
---
INSERT INTO `users` (`updated_at`, `crypted_password`, `username`, `password_salt`, `persistence_token`, `email`, `created_at`) VALUES('2010-08-21 21:42:31', '1d6026db3eb4f8ee48ec1eba0ec19f2b504f45a5956eeec72cc33d549973df10a96cf663d4e6afa638168e6c2771b839e0fe20dee9178539630906609f6dca49', 'tbuser', 'QPyNaRR2vgLF4FSQubD4', '9c3931ecf90e863d241d9220fb57fd2e907eb508a399e39f0ece010100596161004e00344c52be26d3cb8ec49852348ea95a488d33fb3789e25db275ecb431e3', 'tbuser@gmail.com', '2010-08-21 21:42:31')